### Let's begin with some hands-on practice exercises. 

**Create a dataframe wherever necessary**

<table align="left" width=100%>
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left">
                <font color="#21618C" size=4px>
                    <b> 1. Compute minimum and maximum sales for each store and location
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**
   
<table>
<tr>
<th>Store</th>
<th>Location</th>
<th>Sales</th>
</tr>
<tr>
<td>A</td>
<td>Mumbai</td>
<td>40000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>45000</td>
</tr>
<tr>
<td>A</td>
<td>Hyderabad</td>
<td>50000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>90000</td>
</tr>
<tr>
<td>D</td>
<td>Pune</td>
<td>89000</td>
</tr>
<tr>
<td>A</td>
<td>Delhi</td>
<td>87000</td>
</tr>
<tr>
<td>D</td>
<td>Hyderabad</td>
<td>85000</td>
</tr>
<tr>
<td>A</td>
<td>Pune</td>
<td>78000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>89000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>70000</td>
</tr>
   
</table>

In [5]:
import pandas as pd
import numpy as np
md5={ 
     'store': ['A','B','A','C','D','A','D','A','C','B'],
     'Location':['Mumbai','Pune','Hyderabad','Mumbai','Pune','Delhi','Hyderabad','Pune','Mumbai','Pune'],
     'Sales': [40000,45000,50000,90000,89000,87000,85000,78000,89000,70000]
}
df15 = pd.DataFrame(md5)
dfp=pd.pivot_table(data=df15, index=['store','Location'],aggfunc=['min','max'],values=['Sales'])
dfp

                   min    max
                 Sales  Sales
store Location
A     Delhi      87000  87000
      Hyderabad  50000  50000
      Mumbai     40000  40000
      Pune       78000  78000
B     Pune       45000  70000
C     Mumbai     89000  90000
D     Hyderabad  85000  85000
      Pune       89000  89000

<table align="left" width=100%>
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left">
                <font color="#21618C" size=4px>
                    <b> 2. Find duplicate rows based on the column 'Name'
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**
   
<table>
<tr>
<th>Name</th>
<th>Salary</th>
<th>City</th>
</tr>
<tr>
<td>John</td>
<td>3400</td>
<td>Sydeny</td>
</tr>
<tr>
<td>Robert</td>
<td>3000</td>
<td>Chicago</td>
</tr>
<tr>
<td>Aadi</td>
<td>1600</td>
<td>New York</td>
</tr>
<tr>
<td>Robert</td>
<td>3000</td>
<td>Chicago</td>
</tr>
<tr>
<td>Robert</td>
<td>3000</td>
<td>Chicago</td>
</tr>
<tr>
<td>Robert</td>
<td>3000</td>
<td>Texas</td>
</tr>
<tr>
<td>Aadi</td>
<td>4000</td>
<td>London</td>
</tr>
<tr>
<td>Sachin</td>
<td>3000</td>
<td>Chicago</td>
</tr>
   
</table>

In [2]:
md3 = {
    'Name' : ['John','Robert','Aadi','Robert','Robert','Robert','Aadi','Sachine'],
    'Salary' : [3400,3000,1600,3000,3000,3000,4000,3000],
    'City' : ['Sydney', 'Chicago', 'New York','Chicago','Chicago','Texas','London','Chicago']
}
df15 = pd.DataFrame(md3)
df15.duplicated(subset='Name',keep='first')

0    False
1    False
2    False
3     True
4     True
5     True
6     True
7    False
dtype: bool

<table align="left" width=100%>
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left">
                <font color="#21618C" size=4px>
                    <b> 3.  In column tournament, replace all the 'football' values  with 'cricket' using numpy.where
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

 
<table>
<tr>
<th>Days</th>
<th>Tournament</th>
</tr>
<tr>
<td>Mon</td>
<td>Football</td>
</tr>
<tr>
<td>Tues</td>
<td>Cricket</td>
</tr>
<tr>
<td>Wed</td>
<td>Football</td>
</tr>
<tr>
<td>Thurs</td>
<td>Football</td>
</tr>
<tr>
<td>Fri</td>
<td>Cricket</td>
</tr>
   
</table>

In [6]:
md4={
           'Days':['Mon','Tues','Wed','Thurs','Fri'],
            'Tournaments':['Football','Cricket','Football','Football','Cricket']
    
}
df15 = pd.DataFrame(md4)
dfm15=np.where(df15['Tournaments']== 'Football', 'Cricket' , df15['Tournaments'])
print(dfm15)

['Cricket' 'Cricket' 'Cricket' 'Cricket' 'Cricket']

<table align="left" width=100%>
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left">
                <font color="#21618C" size=4px>
                    <b> 4. Get the descriptive statistics of the sales for each season 
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**
   
<table>
<tr>
<th>Month</th>
<th>Sales</th>
<th>Seasons</th>
</tr>
<tr>
<td>Jan</td>
<td>22000</td>
<td>Winter</td>
</tr>
<tr>
<td>Feb</td>
<td>27000</td>
<td>Winter</td>
</tr>
<tr>
<td>Mar</td>
<td>25000</td>
<td>Spring</td>
</tr>
<tr>
<td>Apr</td>
<td>29000</td>
<td>Spring</td>
</tr>
<tr>
<td>May</td>
<td>35000</td>
<td>Spring</td>
</tr>
<tr>
<td>June</td>
<td>67000</td>
<td>Summer</td>
</tr>
<tr>
<td>July</td>
<td>78000</td>
<td>Summer</td>
</tr>
<tr>
<td>Aug</td>
<td>67000</td>
<td>Summer</td>
</tr>
<tr>
<td>Sep</td>
<td>56000</td>
<td>Fall</td>
</tr>
<tr>
<td>Oct</td>
<td>56000</td>
<td>Fall</td>
</tr>
<tr>
<td>Nov</td>
<td>56000</td>
<td>Fall</td>
</tr>
<tr>
<td>Dec</td>
<td>60000</td>
<td>Winter</td>
</tr>

</table>

In [10]:
df11=pd.read_csv('q11..csv')
# print(df11)
# df11.describe(include='Seasons')
# desc_data = df11['Seasons'].describe()
# print(desc_data)
df11.Seasons.describe()

count         12
unique         4
top       Winter
freq           3
Name: Seasons, dtype: object

<table align="left" width=100%>
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left">
                <font color="#21618C" size=4px>
                    <b> 5. Create a new column age with values of your choice. And append it to the below dataframe.
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**
   
<table>
<tr>
<th>Name</th>
<th>Maths</th>
<th>Science</th>
<th>English</th>
</tr>
<tr>
<td>Emma</td>
<td>56</td>
<td>89</td>
<td>89</td>
</tr>
<tr>
<td>Mia</td>
<td>78</td>
<td>87</td>
<td>89</td>
</tr>
<tr>
<td>Sophia</td>
<td>78</td>
<td>78</td>
<td>76</td>
</tr>
<tr>
<td>James</td>
<td>67</td>
<td>89</td>
<td>78</td>
</tr>
<td>John</td>
<td>88</td>
<td>78</td>
<td>87</td>
</tr>
   
</table>

In [11]:
df11=pd.read_csv('q5.csv')
# print(df11)
age={'Age': [32, 45,34,24,43]}
df12=pd.DataFrame(age)
# print(df12)
#df11['Age'] = age  ValueError: Length of values (1) does not match length of index (5)
#df11.append(df12)
# The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
# pd.concat(df11, df12)                   FutureWarning: In a future version of pandas all arguments of concat except for 
#                                         the argument 'objs' will be keyword-only.
     

# df11.insert(4, "Age", (21, 23, 24, 21, 32), True)    insert also we can use to add column
# df11 = df11.assign(Age=[21, 23, 24, 21, 32])            .assign also we can use but we are not able to gives the column index

df13=pd.concat([df11, df12], axis = 1)
print(df13)

     Name  Maths  Science  English  Age
0    Emma     56       89       89   32
1     Mia     78       87       89   45
2  Sophia     78       78       76   34
3   James     67       89       78   24
4    John     88       78       87   43

<table align="left" width=100%>
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left">
                <font color="#21618C" size=4px>
                    <b> 6. Perform right join to combine values based on the columns 'MA(Hons)' and 'Stud_ID' in the two dataframes
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**
   
<table>
    <tr>
        <th>Stud_ID</th>
        <th>Name</th>
        <th>MA(Hons)</th>
    </tr>
    <tr>
        <td>101</td>
        <td>Alex</td>
        <td>History</td>
    </tr>
    <tr>
        <td>102</td>
        <td>Amy</td>
        <td>English</td>
    </tr>
    <tr>
        <td>103</td>
        <td>Allen</td>
        <td>Geography</td>
    </tr>
    <tr>
        <td>104</td>
        <td>Alice</td>
        <td>German</td>
    </tr>
        <td>105</td>
        <td>James</td>
        <td>History</td>
    </tr>  
</table>
<br>



<table>
    <tr>
        <th>Stud_ID</th>
        <th>Res_City</th>
        <th>MA(Hons)</th>
    </tr>
    <tr>
        <td>101</td>
        <td>Delhi</td>
        <td>English</td>
    </tr>
    <tr>
        <td>102</td>
        <td>Mumbai</td>
        <td>History</td>
    </tr>
    <tr>
        <td>103</td>
        <td>Delhi</td>
        <td>Fine Arts</td>
    </tr>
    <tr>
        <td>104</td>
        <td>Chennai</td>
        <td>German</td>
    </tr>
        <td>105</td>
        <td>Hyderabad</td>
        <td>History</td>
    </tr>
</table>

In [13]:
df16=pd.read_csv('q6a.csv')
df17=pd.read_csv('q6b.csv')
dfm6 = pd.merge(left = df16, right = df17 , how = 'right' ,on=['MA(Hons)','Stud_ID'], indicator=True)
print(dfm6)

   Stud_ID   Name   MA(Hons)   Res_City      _merge
0      101    NaN    English      Delhi  right_only
1      102    NaN    History     Mumbai  right_only
2      103    NaN  Fine Arts      Delhi  right_only
3      104  Alice     German    Chennai        both
4      105  James    History  Hyderabad        both

<table align="left" width=100%>
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left">
                <font color="#21618C" size=4px>
                    <b> 7. Using the dataframes created in question 6, perform inner join to combine values based on the columns 'MA(Hons)' and 'Stud_ID' in the two dataframes
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [14]:
df18=pd.read_csv('q6a.csv')
df19=pd.read_csv('q6b.csv')
dfm7 = pd.merge(left = df16, right = df17 , how = 'inner' ,on=['MA(Hons)','Stud_ID'], indicator=True)
print(dfm7)

   Stud_ID   Name MA(Hons)   Res_City _merge
0      104  Alice   German    Chennai   both
1      105  James  History  Hyderabad   both

<table align="left" width=100%>
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left">
                <font color="#21618C" size=4px>
                    <b> 8. Concatenate two dataframes along the columns
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**
   
<table>
    <tr>
        <th>Stud_ID</th>
        <th>Name</th>
    </tr>
    <tr>
        <td>101</td>
        <td>Alex</td>
    </tr>
    <tr>
        <td>102</td>
        <td>Amy</td>
    </tr>
    <tr>
        <td>103</td>
        <td>Allen</td>
    <tr>
        <td>104</td>
        <td>Alice</td>
    </tr>
        <td>105</td>
        <td>James</td>
    </tr>  
</table>
<br>



<table>
    <tr>
        <th>Res_City</th>
        <th>MA(Hons)</th>
    </tr>
    <tr>
        <td>Delhi</td>
        <td>English</td>
    </tr>
    <tr>
        <td>Mumbai</td>
        <td>History</td>
    </tr>
    <tr>
        <td>Delhi</td>
        <td>Fine Arts</td>
    </tr>
    <tr>
        <td>Chennai</td>
        <td>German</td>
    </tr>
        <td>Hyderabad</td>
        <td>History</td>
    </tr>
</table>

In [15]:
df20=pd.read_csv('q8.csv')
df21=pd.read_csv('q8b.csv')
df20=pd.concat([df20, df21], axis = 1)
print(df20)

   Stud_ID   Name   Res_City   MA(Hons)
0      101   Alex      Delhi    English
1      102    Amy     Mumbai    History
2      103  Allen      Delhi  Fine Arts
3      104  Alice    Chennai     German
4      105  James  Hyderabad    History

<table align="left" width=100%>
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left">
                <font color="#21618C" size=4px>
                    <b> 9. Calculate minimum, maximum and average sales for each season
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**
   
<table>
<tr>
<th>ID</th>
<th>Name</th>
<th>Subject</th>
</tr>
<tr>
<td>101</td>
<td>Alex</td>
<td>Maths</td>
</tr>
<tr>
<td>102</td>
<td>Amy</td>
<td>English</td>
</tr>
<tr>
<td>103</td>
<td>Allen</td>
<td>Science</td>
</tr>
<tr>
<td>104</td>
<td>Alice</td>
<td>German</td>
</tr>
<td>105</td>
<td>Ayoung</td>
<td>History</td>
</tr>
   
</table><br>



<table>
<tr>
<th>ID</th>
<th>Name</th>
<th>Subject</th>
</tr>
<tr>
<td>101</td>
<td>Billy</td>
<td>English</td>
</tr>
<tr>
<td>102</td>
<td>Brian</td>
<td>Science</td>
</tr>
<tr>
<td>103</td>
<td>Bran</td>
<td>Social Science</td>
</tr>
<tr>
<td>104</td>
<td>Bryce</td>
<td>German</td>
</tr>
<td>105</td>
<td>Betty</td>
<td>History</td>
</tr>
   
</table>

In [16]:
df11=pd.read_csv('q11..csv')
# print(df11)
print(df11.groupby(by='Seasons')['Sales'].min())
print(df11.groupby(by='Seasons')['Sales'].max())
print(df11.groupby(by='Seasons')['Sales'].mean())

Seasons
Fall      56000
Spring    25000
Summer    67000
Winter    22000
Name: Sales, dtype: int64
Seasons
Fall      56000
Spring    35000
Summer    78000
Winter    60000
Name: Sales, dtype: int64
Seasons
Fall      56000.000000
Spring    29666.666667
Summer    70666.666667
Winter    36333.333333
Name: Sales, dtype: float64

<table align="left" width=100%>
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left">
                <font color="#21618C" size=4px>
                    <b> 10. Find all the duplicate entries based on the columns X and Y.
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**
   
<table>
<tr>
<th>X</th>
<th>Y</th>
<th>Z</th>
</tr>
<tr>
<td>1</td>
<td>2</td>
<td>5</td>
</tr>
<tr>
<td>2</td>
<td>2</td>
<td>6</td>
</tr>
<tr>
<td>3</td>
<td>1</td>
<td>2</td>
</tr>
<tr>
<td>1</td>
<td>2</td>
<td>6</td>
</tr>
<tr>
<td>2</td>
<td>2</td>
<td>1</td>
</tr>
<tr>
<td>3</td>
<td>4</td>
<td>6</td>
</tr>
<tr>
<td>2</td>
<td>2</td>
<td>2</td>
</tr>
<tr>
<td>2</td>
<td>2</td>
<td>8</td>
</tr>

</table>

**Use the dataframe given below:**
   
<table>
<tr>
<th>Month</th>
<th>Sales</th>
<th>Seasons</th>
</tr>
<tr>
<td>Jan</td>
<td>22000</td>
<td>Winter</td>
</tr>
<tr>
<td>Feb</td>
<td>27000</td>
<td>Winter</td>
</tr>
<tr>
<td>Mar</td>
<td>25000</td>
<td>Spring</td>
</tr>
<tr>
<td>Apr</td>
<td>29000</td>
<td>Spring</td>
</tr>
<tr>
<td>May</td>
<td>35000</td>
<td>Spring</td>
</tr>
<tr>
<td>June</td>
<td>67000</td>
<td>Summer</td>
</tr>
<tr>
<td>July</td>
<td>78000</td>
<td>Summer</td>
</tr>
<tr>
<td>Aug</td>
<td>67000</td>
<td>Summer</td>
</tr>
<tr>
<td>Sep</td>
<td>56000</td>
<td>Fall</td>
</tr>
<tr>
<td>Oct</td>
<td>56000</td>
<td>Fall</td>
</tr>
<tr>
<td>Nov</td>
<td>56000</td>
<td>Fall</td>
</tr>
<tr>
<td>Dec</td>
<td>60000</td>
<td>Winter</td>
</tr>

</table>

In [17]:
df10=pd.read_csv('q10.csv')
df10.duplicated(subset=['X','Y'],keep='first')

0    False
1    False
2    False
3     True
4     True
5    False
6     True
7     True
dtype: bool